#### Terragrunt Initialization `success`
#### Terragrunt Plan `success`
<details><summary>Show Plan</summary>```terragrunt
module.data_processor.aws_s3_bucket.b: Refreshing state... [id=curi-test-data-test-bucket]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.data_processor.aws_s3_bucket.b must be replaced
-/+ resource "aws_s3_bucket" "b" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::curi-test-data-test-bucket" -> (known after apply)
      ~ bucket                      = "curi-test-data-test-bucket" -> "curi-test-data-test-bucket-2" # forces replacement
      ~ bucket_domain_name          = "curi-test-data-test-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "curi-test-data-test-bucket.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "curi-test-data-test-bucket" -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ apply_server_side_encryption_by_default {
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```</details>
*Pusher: @jperson, Action: `pull_request`*